{
    "@ouooreo8150": "its so trash",
    "@elcaca_": "im gonna be a dumbass and im gonna make a breakcore version of this",
    "@SunWukong-e8q": "bros birth certificate is an apology from the condom company",
    "@Emiri-l7i": "Wtf is this",
    "@racklost": "0:00 had to be the best part",
    "@Seth-pv9gc": "Not gonna lie Ksi this feels like it could be my 4th grade theme song and I kinda like it I actually dont mind the song",
    "@femmeshark": "Yo, this shit is water ",
    "@HedgehogSpeedSonic": "This honestly sounds like just another song on the radio. I'm not sure what the hype is about.",
    "@troi3750": "Lowkey 2k24 intro music slaps harder than this",
    "@Angel-Here-alt": "Yeah this is why I want to off myself because I hate 2024",
    "@simple6781": "Holy shit this is so ass ",
    "@fortnight12322": "Good music I actually love this song",
    "@5smokin": "It ain't even bad y'all ",
    "@Palestinemapping": "Be honest you didnt get this in ur recommendations you searched it up.",
    "@cliffrodneyhuypungco4527": "Thank you KSI for releasing this song, i was listening to this song then i suddenly became deaf because of you. Tyyy<3 ",
    "@Reiunkonw": "BRO ATE  WE'RE IN RAMADAN",
    "@setsunafsieie": "Wtf",
    "@mrboone559": "The song isn't even bad, don't know where the toxicity coming from",
    "@vinayakshukla1296": "\"The only reason i'm listening to this song cuz it reminds of 2016\" ahh music...",
    "@UNIQUE_UCHIHA": "Instagram lvl hate on yt",
    "@lukelaver-u6t": "these comments are hilarious",
    "@AlbyPlaysGames": "This shit ass",
    "@Xoticfigr": "too easy to hate nowadays, mans probably liked his track but is getting dissed like he worked on Disney channel with Jeffrey and Diddy at his side",
    "@bcl41002": "chours is tough",
    "@greendayrocksmuch": "Sounds like that Chinese SpongeBob song super idol lmaooo",
    "@DrakeGrell": "Yall haters fr this song fire!! ",
    "@Bulzack-wr1ii": "STILL NO EPSTEIN LIST",
    "@zanderhansen-c3x": "this song is ass",
    "@parkernelson4909": "\"I don't know no nothing\"  my mans spittin trash ",
    "@halalmon": "Guys we need the top comment to ratio a video for once just do it",
    "@slothymango": "When i die and go to hell im gonna play this so Satan give me to heaven",
    "@rat_king0": "0:53 IS THE START OF THE GOOFIEST PART",
    "@LilFazzy": "woah woah woah",
    "@puregarbage2329": "Tfw you run out of money for features.",
    "@HooliganFromTrinidad": "2017 ahh music",
    "@RXQswift248": "Roblox outro ahh music",
    "@loolfuumny": "This is good everyone is jealous man you killed the chorus and the singing good singing from a UK person for sure",
    "@bruhbruhbruh-bd2kz": "Thick of it \nSick of it ",
    "@nooooo-wr2jg": "Thick of it \nTurning it off ",
    "@France467": "1:49 \"ain't nobody gonna save you\" more like ain't nobody gonna save lunchly",
    "@worbear73008": "On everyone's soul except mine this shit fire",
    "@Wellwall13": "I don't know why people are hating this song it's fire ",
    "@1Type9": "It sounds like a 2018 night core song ",
    "@KindaAlnabulsi": "Im the alpha Im the leader ahh song ",
    "@zerxyy3872": "This is Ear abuse.",
    "@jreb9283": "This shit caused the hurricane",
    "@almamedina1538": "so good so fire!!",
    "@Mania743": "Me in 2016 wouldve been jamming to this on LOOP ",
    "@sukritatangjai9626": "0:53",
    "@zigyiplier": "Disney villain ahh music",
    "@mahirpatel1654": "They need to play this at my funeral I'll get out of the coffin to turn this shit off",
    "@AFatCat": "I'm gonna lie this is fire ",
    "@SkibidiToilet-vw7tz": "'From the screen to the ring to the pen to the king' goes insanely hard\n(Timestamp is 0:52)",
    "@RAYZ7Z7": "credits aah music",
    "@aveetha4585": "Music is getting by KSI",
    "@MrCat-jg3bm": "By this point the comments are more artistic than this song",
    "@Karanprk56": "\"Kid if you dont sleep i will definately play this\"- AVG INDIAN MOM",
    "@theforestrealm8783": "2017 Minecraft YouTuber intro ahh song ",
    "@RottingCabbage": "KSI \nKMS ",
    "@TheMan1123581321": "\"Dream roadtrip\" ahh song ",
    "@funnyboingo": "Sick of it.",
    "@MatthewLitwiz": "I watched the whole 2 minute and 41 second of this song and hated it, but spent 40 minute reading the comment and I'm already down 2 buckets of popcorn, most entertaining thing so far this year.",
    "@zmoneydawg": "That 2010 ahhh music",
    "@Taha-p1w1f": "Where's my crown, that's my bling, talking about that shiny forhead",
    "@robertozuniga-zr8uj": "",
    "@StriveForFreedomSFF": "on a serious note this is the worst thing thats happened since prime",
    "@_MrRizz_": "BRO COOKED SO HARD I GOT LOSE MOTION HEARING THIS  ",
    "@383VK": "100k dislikes btw",
    "@IRespectHestia": "Yo, KSI! We might be on different timezones. Trash pickup day is tomorrow for me.",
    "@by-926": "I am sick of it KSI stop we dont need another one",
    "@Ivan-u7s7c": "Ts so ass I considered suicide",
    "@Popaddypop": "Guys stop making fun of KSI he just gave deaf people a reason to be happy",
    "@giovannerubio8480": "I mean it's not at all",
    "@DevianaOnggo": "ngl it fire",
    "@Kwebblelkopfan7": "Vilonts are red roses are blue i just wasted my time on this bad song",
    "@Rizzy01": "This is the end isnt it? Ahh music ",
    "@allenjonesstyles6112": "We are all \" Thick(Sick) of it \" ",
    "@MattEliteStorm": "Censoring anyone who criticises your song ",
    "@Sklo-j1t": "This sucks",
    "@RayanAqdim": "Lkhra",
    "@SplinterzMC": "Blood, I dunno if you are gonna read this in the sea of hate, but I genuinely like this song.\nDont stress on the haters lad, hate it or love it, you livin in peoples heads rent free. You won already.\nRemember the old maxim: any publicity is good publicity.",
    "@AstralxPlays": "I mean It's still better than Taylor Swift ",
    "@RonaldoGoat7W": "Not even tryna be funny this shi is fire why everyone making fun",
    "@phobiaAOE": "Bro. 3 Seconds. I wanna self escapism.",
    "@Dabears-rt3": "Yo ksi i lnow you have. Been getting lots of hate but i think its fire just remember all these people are just haters they dont like you so they hate on you but i love it keep it up",
    "@gatorduck": "what's with the SpongeBob font ",
    "@GUHANDPLUH": "bro british with no music talent im finna make a tycoon on roblox with this song",
    "@KingdomofEngland1": "Goes hard on mute",
    "@apexgamesplus4860": "Moja babcia piewa lepiej",
    "@TheZomBat": "This is the type of shit a PE teacher thinks would go hard whilst doing circuit training.",
    "@martbarnav1787": "This is so trash it made youtube comments funny again",
    "@rollindownstones1613": "I should have this shit play on loop when I go for a run and I can only turn it off when I run 10 miles Ty KSI for making music so ass I'm motivated to do this  100 likes and I do it",
    "@101TClan": "this song is so bad my baby cousin cried when hearing this",
    "@Brawler_crawler": "The song is actually fine but the ARTIST ummmm....",
    "@rainbow30sam763": "THANK GOD I HAVE HEARING LOSS ",
    "@gladiatorriot2384": "Goofy ah music"
}